############################################################################
#　assert
# assert的意思是，表达式n != 0应该是True，否则，根据程序运行的逻辑，后面的代码肯定会出错
# 如果断言失败，assert语句本身就会抛出AssertionError
def foo(s):
    n = int(s)
    assert n != 0, 'n is zero!'
    return 10/n

def main():
    foo('0')

############################################################################
# logging
# 和assert比，logging不会抛出错误，而且可以输出到文件
import logging
s = '0'
n = int(s)
logging.info('n = %d' %n)
print(10/n)

############################################################################
